docs/comp-sci/numerical-analysis.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-10 Sat 20:46 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Numerical Analysis</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Numerical Analysis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org117d5d8">1. Overview</a></li>
<li><a href="#org76ec24e">2. References</a>
<ul>
<li><a href="#orgdff8322">2.1. Numerical Differenial Equations</a></li>
<li><a href="#orgb3f01b6">2.2. Theorem Provers and Numerical Analysis</a></li>
<li><a href="#org4cb1c1b">2.3. Numerical Linear Algebra</a></li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<p>
Numerical analysis is the blackest of the black arts. (Gerald Sussman)
</p>
</blockquote>

<div id="outline-container-org117d5d8" class="outline-2">
<h2 id="org117d5d8"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
The basic problem numerical analysis addresses: given some
computation we want to perform in mathematics, how can we get the
computer to do it? Specifically when we approximate real numbers by
floating-point arithmetic, and we do not perform any symbolic
manipulation.
</p>

<ul class="org-ul">
<li><a href="numerical-analysis/index.html">Index of Topics</a></li>
</ul>
</div>
</div>

<div id="outline-container-org76ec24e" class="outline-2">
<h2 id="org76ec24e"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Richard L. Burden and J. Douglas Faires,
<cite class="book-title">Numerical Analysis</cite>.
8th ed., Thomson, 2005.</li>
<li>David Goldberg,
"What Every Computer Scientist Should Know About Floating-Point Arithmetic".
March 1991, <a href="https://docs.oracle.com/cd/E19957-01/806-3568/ncg_goldberg.html">eprint</a>.</li>
<li>Peter Olver,
<a href="https://www-users.math.umn.edu/~olver/num.html">Lecture notes on Numerical Analysis</a>.</li>
</ul>
</div>

<div id="outline-container-orgdff8322" class="outline-3">
<h3 id="orgdff8322"><span class="section-number-3">2.1</span> Numerical Differenial Equations</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>J. C. Butcher,
<cite class="book-title">Numerical Methods for Ordinary Differential Equations</cite>.
3rd Edition</li>
<li>David F. Griffiths, Desmond J. Higham,
<cite class="book-title">Numerical Methods for Ordinary Differential Equations: Initial Value Problems</cite>.</li>
</ul>
</div>
</div>


<div id="outline-container-orgb3f01b6" class="outline-3">
<h3 id="orgb3f01b6"><span class="section-number-3">2.2</span> Theorem Provers and Numerical Analysis</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Sylvie Boldo, Claude Marché,
"Formal verification of numerical programs: from C annotated programs to mechanical proofs".
<a href="https://hal.inria.fr/hal-00777605/document">Eprint</a>, 2013, 18 pages.</li>
<li>Ruben Antonio Gamboa,
"Mechanically Verifying Real-Valued Algorithms in ACL2".
PhD thesis, U. Texas at Austin, <a href="https://www.cs.utexas.edu/ftp/boyer/diss/gamboa.pdf">PDF</a></li>
<li>David M Russinoff,
<cite class="book-title">Formal Verification of Floating-Point Hardware Design: A Mathematical Approach</cite>.
Springer, 2018.</li>
</ul>
</div>
</div>

<div id="outline-container-org4cb1c1b" class="outline-3">
<h3 id="org4cb1c1b"><span class="section-number-3">2.3</span> Numerical Linear Algebra</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>G.W. Stewart, <cite class="book-title">Matrix Algorithms</cite>. 2 volumes</li>
<li>James Demmel, <cite class="book-title">Applied Numerical Linear Algebra</cite>.</li>
<li>Trefethen and Bau, <cite class="book-title">Numerical linear algebra</cite>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-03-18 Thu 15:46.</p>
</div>
</body>
</html>